# 1

1. Min-Max scaling using numpy

1. Create a numpy array that starts at 0 and end at 99 using arange()
2. Do min-max scaling using numpy functions, min() n max()

In [18]:
import numpy as np
p=np.arange(0, 100, 1)
print(p)

[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47
 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71
 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95
 96 97 98 99]

In [25]:
v = p   
print(v.min())
print(v.max())
foo = (v - v.min()) / (v.max() - v.min())
foo

0
99

array([0.        , 0.01010101, 0.02020202, 0.03030303, 0.04040404,
       0.05050505, 0.06060606, 0.07070707, 0.08080808, 0.09090909,
       0.1010101 , 0.11111111, 0.12121212, 0.13131313, 0.14141414,
       0.15151515, 0.16161616, 0.17171717, 0.18181818, 0.19191919,
       0.2020202 , 0.21212121, 0.22222222, 0.23232323, 0.24242424,
       0.25252525, 0.26262626, 0.27272727, 0.28282828, 0.29292929,
       0.3030303 , 0.31313131, 0.32323232, 0.33333333, 0.34343434,
       0.35353535, 0.36363636, 0.37373737, 0.38383838, 0.39393939,
       0.4040404 , 0.41414141, 0.42424242, 0.43434343, 0.44444444,
       0.45454545, 0.46464646, 0.47474747, 0.48484848, 0.49494949,
       0.50505051, 0.51515152, 0.52525253, 0.53535354, 0.54545455,
       0.55555556, 0.56565657, 0.57575758, 0.58585859, 0.5959596 ,
       0.60606061, 0.61616162, 0.62626263, 0.63636364, 0.64646465,
       0.65656566, 0.66666667, 0.67676768, 0.68686869, 0.6969697 ,
       0.70707071, 0.71717172, 0.72727273, 0.73737374, 0.74747475,
       0.75757576, 0.76767677, 0.77777778, 0.78787879, 0.7979798 ,
       0.80808081, 0.81818182, 0.82828283, 0.83838384, 0.84848485,
       0.85858586, 0.86868687, 0.87878788, 0.88888889, 0.8989899 ,
       0.90909091, 0.91919192, 0.92929293, 0.93939394, 0.94949495,
       0.95959596, 0.96969697, 0.97979798, 0.98989899, 1.        ])

# 2

2. Create Data Frames using given list and dictionaries
 List: Data = [0.25, 0.5, 0.75, "Make India Great Again!"], index=['a', 'b', 'c', 'd']
Dictionary  : {"a" : 0.25, "b" :  0.5, "c" : 0.75, "d" : "Make India Great Again!"}

In [31]:
import pandas

In [34]:
data = ["0.25", "0.5", "0.75", "Make India Great Again!"]
data
df1 = pandas.DataFrame(np.array(data).reshape(1,4), columns=['a', 'b', 'c', 'd'])
df1

      a    b     c                        d
0  0.25  0.5  0.75  Make India Great Again!

In [35]:
dictionary = {'a':['0.25'], 'b':['0.5'], 'c':['0.75'], 'd':['Make India Great Again!']}
df2 = pandas.DataFrame.from_dict(dictionary)
df2

      a    b     c                        d
0  0.25  0.5  0.75  Make India Great Again!

# 3
3. Convert  the  above sampleDataFromList Dataframe to numpy array

In [36]:
list_array = df1.to_numpy()
list_array

array([['0.25', '0.5', '0.75', 'Make India Great Again!']], dtype=object)

# 4
4.Create a data frame with the given data : 

"Name" : ["Amar", "Mia", "Yash", "Lucky", "Josh" , "Sree"] 
 "City" : ["Bangalore", "Hyderabad", "Bangalore", "Hyderabad", "Bangalore", "Hyderabad"]
  "Age" : [25, 25, 23, 26, 27, 40]


Apply the Group By method on the data frame and store it by converting it into a list. 
Perform operations on a group by object to return a Data Frame.
Count()
mean()
Apply sum

In [37]:
dict1 = {"Name" : ["Amar", "Mia", "Yash", "Lucky", "Josh" , "Sree"],
 "City" : ["Bangalore", "Hyderabad", "Bangalore", "Hyderabad", "Bangalore", "Hyderabad"],
  "Age" : [25, 25, 23, 26, 27, 40]
}
df3 = pandas.DataFrame(dict1)
df3

    Name       City  Age
0   Amar  Bangalore   25
1    Mia  Hyderabad   25
2   Yash  Bangalore   23
3  Lucky  Hyderabad   26
4   Josh  Bangalore   27
5   Sree  Hyderabad   40

In [38]:
df3.groupby('City').count()

           Name  Age
City
Bangalore     3    3
Hyderabad     3    3

In [39]:
df3.groupby('City').mean()

                 Age
City
Bangalore  25.000000
Hyderabad  30.333333

In [40]:
df3.groupby('City').sum()

           Age
City
Bangalore   75
Hyderabad   91